---
kind: method
id: M:Autodesk.Revit.DB.ElementIdParameterValue.#ctor
source: html/4a389fb9-10ba-e252-1986-56eb87ba5f67.htm
---
# Autodesk.Revit.DB.ElementIdParameterValue.#ctor Method

Default constructor

## Syntax (C#)
```csharp
public ElementIdParameterValue()
```